# Пользователь вводит возраст
# Программа должна вывести, сколько
# лет будет пользователю через год

age = int(input('Сколько вам лет: '))

print(age + 1)
